RUN_STRINGS = (
     "ඔයා කොහෙද යන්නේ කියලා ඔයා හිතන්නේ?",
     "හහ්? මොකක්ද? ඔවුන් පැනලා ගියාද?",
     "ZZzzZZzz ... හහ්? මොකක්ද? ඔහ්, ඔවුන් නැවත වරක්, කමක් නැහැ.",
     "නැවත මෙහි එන්න!",
     "එතරම් වේගවත් නොවේ ...",
     "බිත්තිය දෙස බලන්න!",
     "මාව ඔවුන් සමඟ තනි නොකරන්න !!",
     "ඔයා දුවනවා, ඔයා මැරෙනවා.",
     "ඔබට විහිළු, මම සෑම තැනකම සිටිමි",
     "ඔයා ඒ ගැන පසුතැවෙනවා ...",
     "ඔබටත් උත්සාහ කළ හැකිය / පයින් ගසන්න, එය විනෝදජනක බව මට අසන්නට ලැබේ.",
     "වෙනත් කෙනෙකුට කරදර කරන්න, මෙහි කිසිවෙකු ගණන් ගන්නේ නැත.",
     "ඔබට දුවන්න පුළුවන්, නමුත් ඔබට සැඟවිය නොහැක.",
     "ඔබට ලැබී ඇත්තේ එපමණක්ද?",
     "මම ඔබ පිටුපස සිටිමි ...",
     "ඔබට සමාගමක් ඇත!",
     "අපට මෙය පහසුම ක්‍රමය හෝ දුෂ්කර ක්‍රමය කළ හැකිය.",
     "ඔබට එය තේරෙන්නේ නැහැ නේද?",
     "ඔව්, ඔබ දුවනවා නම් හොඳයි!",
     "කරුණාකර, මට කොතරම් සැලකිල්ලක් දක්වනවාදැයි මට මතක් කරන්න?",
     "මම ඔබ නම් මම වේගයෙන් දුවමි.",
     "එය අනිවාර්යයෙන්ම අපි සොයන ඩ්‍රොයිඩ් ය.",
     "අවාසි ඔබට වාසිදායක වේවා.",
     "ප්රසිද්ධ අවසන් වදන්.",
     "ඔවුන් සදහටම අතුරුදහන් විය, නැවත කිසිදිනෙක නොපෙනේ.",
     "\" ඔහ්, මා දෙස බලන්න!  මම හරිම සිසිල්, මට බොට් එකකින් දුවන්න පුළුවන්! \ "- මේ පුද්ගලයා",
     "ඔව් ඔව්, දැනටමත් තට්ටු කරන්න / පයින් ගසන්න.",
     "මෙන්න, මෙම මුද්ද රැගෙන ඔබ එහි සිටින විට මොර්ඩෝර් වෙත යන්න.",
     "පුරාවෘත්තය සතුව ඇත, ඒවා තවමත් ක්‍රියාත්මක වේ ...",
     "හැරී පොටර් මෙන් නොව, ඔබේ දෙමාපියන්ට මා වෙතින් ඔබව ආරක්ෂා කළ නොහැක.",
     "බිය කෝපයට තුඩු දෙයි. කෝපය වෛරයට තුඩු දෙයි. වෛරය දුක් වේදනා වලට තුඩු දෙයි. ඔබ දිගටම බියෙන් දුවන්නේ නම්, ඔබට එය කළ හැකිය."
     "ඊළඟ වඩර් වන්න.",
     "බහුවිධ ගණනය කිරීම් පසුව, ඔබේ ෂෙනානිගන් පිළිබඳ මගේ උනන්දුව හරියටම 0 බව මම තීරණය කර ඇත්තෙමි.",
     "පුරාවෘත්තය සතුව ඇත, ඒවා තවමත් ක්‍රියාත්මක වේ.",
     "එය දිගටම කරගෙන යන්න, කෙසේ හෝ අපට ඔබව මෙහි අවශ්‍ය බව විශ්වාස නැත.",
     "ඔයා විශාරදයෙක්- ඔහ්, ඉන්න. ඔයා හැරී නෙවෙයි, දිගටම ඉදිරියට යන්න.",
     "හැල්වේස් හි ධාවනය නොවේ!",
     "හස්ටා ලා විස්ටා, බබා.",
     "කවුද බල්ලන්ට එළියට දුන්නේ?",
     "එය විහිළුවක්, කිසිවෙකු ගණන් නොගන්නා නිසා.",
     "ආහ්, මොනතරම් නාස්තියක්ද, මම එයට කැමතියි.",
     "අවංකවම, මගේ ආදරණීය, මම නරකක් දෙන්නේ නැහැ.",
     "මගේ මිල්ක්ෂේක් සියලුම පිරිමි ළමයින් මිදුලට ගෙන එයි ... එබැවින් වේගයෙන් දුවන්න!",
     "ඔබට සත්‍යය හසුරුවා ගත නොහැක!",
     "බොහෝ කලකට පෙර, මන්දාකිනියක බොහෝ away තින් ... කවුරුහරි ඒ ගැන සැලකිලිමත් වනු ඇත. තවදුරටත් එසේ නොවේ.",
     "හේයි, ඔවුන් දෙස බලන්න! ඔවුන් දුවන්නේ නොවැළැක්විය හැකි බැන්හම්මර් වලින් ... හුරුබුහුටි.",
     "හැන් මුලින්ම වෙඩි තැබුවා. මමත් එහෙමයි",
     "සුදු හාවෙකු ඔබ පසුපස දුවන්නේ කුමක් ද?",
     "වෛද්‍යවරයා පවසන පරිදි ... ධාවනය කරන්න!",
 )

 INSULTS_STRINGS = (
     "අපොයි ... එවැනි මෝඩ මෝඩයෙක්.",
     "බොන්න සහ ටයිප් නොකරන්න.",
     "මම හිතන්නේ ඔබ ගෙදර යා යුතුයි, නැත්නම් මානසික රැකවරණයක් ලබා ගත යුතුයි.",
     "විධානය හමු නොවීය. ඔබේ මොළය මෙන්.",
     "ඔබ ඔබව මෝඩයෙකු කරන බව ඔබට වැටහෙනවාද? පෙනෙන හැටියට එසේ නොවේ.",
     "ඔබට ඊට වඩා හොඳින් ටයිප් කළ හැකිය.",
     "බොට් රීතිය 544 9 වන වගන්තිය ඔබ වැනි මෝඩ මිනිසුන්ට පිළිතුරු දීම වළක්වයි.",
     "කණගාටුයි, අපි මොළය විකුණන්නේ නැත.",
     "මාව විශ්වාස කරන්න ඔබ සාමාන්‍ය කෙනෙක් නොවේ.",
     "මම හිතනවා ඔයාගේ මොළය අලුත් දෙයක් වගේ දැනෙනවා, ඔබ එය කිසි විටෙකත් භාවිතා නොකරන බව."
     "මට මාව මරා දැමීමට අවශ්‍ය නම් මම ඔබේ ඊගෝව තරණය කර ඔබගේ IQ වෙත පනින්නෙමි.",
     "Zombies මොළය කනවා ... ඔබ ආරක්ෂිතයි",
     "ඔබ පරිණාමය වූයේ වානරයන්ගෙන් නොවේ, ඔවුන් ඔබෙන් පරිණාමය විය.",
     "ඔබගේ වයස ඉක්මවා යන විට නැවත පැමිණ මා සමඟ කතා කරන්න.",
     "මම කියන්නේ නැහැ ඔයා මෝඩයෙක් කියලා, මම කියන්නේ හිතනකොට ඔයාට නරක වාසනාවක් ලැබුණා කියලයි.",
     "ඔබ කතා කරන්නේ කුමන භාෂාවද? එය ගොන් කතා වගේ.",
     "මෝඩකම අපරාධයක් නොවේ, එබැවින් ඔබට යාමට නිදහස තිබේ.",
     "පරිණාමය ආපසු හැරවිය හැකි බවට ඔබ සාක්ෂි දරයි.",
     "ඔබේ වයස කීයදැයි මම ඔබෙන් අසමි. නමුත් මම දන්නවා ඔබට එතරම් ඉහළ අගයක් ගත නොහැකි බව."
     "පිටස්තරයෙකු ලෙස, මිනිස් සංහතිය ගැන ඔබ සිතන්නේ කුමක්ද?",
     "මොළය සියල්ලම නොවේ. ඔබේ නඩුවේ ඒවා කිසිවක් නැත.",
     "සාමාන්‍යයෙන් මිනිස්සු ජීවත් වෙලා ඉගෙන ගන්නවා. ඔයා ජීවත් වෙන්න.",
     "ඔබ මෙතරම් මෝඩ වන්නේ කුමක් දැයි මම නොදනිමි, නමුත් එය සැබවින්ම ක්‍රියාත්මක වේ.",
     "දිගටම කතා කරන්න, කවදාහරි ඔබ බුද්ධිමත් දෙයක් කියයි! (මට එය සැකයි)",
     "මට කම්පනය කරන්න, බුද්ධිමත් යමක් කියන්න.",
     "ඔබේ IQ ඔබේ සපත්තු ප්‍රමාණයට වඩා අඩුයි.",
     "අහෝ! ඔබේ ස්නායු සම්ප්‍රේෂක තවදුරටත් ක්‍රියාත්මක නොවේ.",
     "ඔයාට පිස්සුද මෝඩයා.",
     "සෑම කෙනෙකුම මෝඩ වීමට අයිතියක් ඇත. නමුත් ඔබ වරප්‍රසාදය අනිසි ලෙස භාවිතා කරයි."
     "මට කණගාටුයි, මම ඔබව මෝඩයෙකු ලෙස හැඳින්වූ විට ඔබේ හැඟීම් රිදෙව්වා. මම හිතුවේ ඔබ දැනටමත් එය දන්නා බවයි.",
     "ඔබ සයනයිඩ් රස බැලීමට උත්සාහ කළ යුතුයි.",
     "ඔබේ එන්සයිම මීයන්ගේ විෂ ජීර්ණය කිරීමට අදහස් කරයි.",
     "ඔබ සදහටම නිදා ගැනීමට උත්සාහ කළ යුතුයි.",
     "තුවක්කුවක් අරගෙන ඔබටම වෙඩි තියන්න.",
     "පැරෂුට් නොමැතිව ගුවන් යානයකින් පැනීමෙන් ඔබට ලෝක වාර්තාවක් තැබිය හැකිය.",
     "බීඑස් කතා කිරීම නවතා දුවන බුලට් දුම්රියක් ඉදිරිපිට පනින්න.",
     "ජලය වෙනුවට හයිඩ්‍රොක්ලෝරික් අම්ලය සමඟ ස්නානය කිරීමට උත්සාහ කරන්න.",
     "මෙය උත්සාහ කරන්න: ඔබ ඔබේ හුස්ම පැයක් පමණ දිය යට තබා ගන්නේ නම්, ඔබට එය සදහටම රඳවා ගත හැකිය.",
     "කොළ පාටට යන්න! ඔක්සිජන් ආශ්වාස කිරීම නවත්වන්න.",
     "දෙවියන් වහන්සේ ඔබව සොයමින් සිටියේය. ඔබ ඔහුව හමුවීමට පිටත්ව යා යුතුය.",
     "ඔබේ 100% දෙන්න. දැන් ගිහින් ලේ දන් දෙන්න.",
     "මහල් සියයක ගොඩනැගිල්ලකින් පැනීමට උත්සාහ කරන්න, නමුත් ඔබට එය කළ හැක්කේ එක් වරක් පමණි.",
     "ඔබ කිසි විටෙකත් එය භාවිතා නොකළ බව දැක ඔබේ මොළය පරිත්යාග කළ යුතුය.",
     "වෙඩි තැබීමේ පරාසයක ඉලක්කය සඳහා ස්වේච්ඡාවෙන් ඉදිරිපත් වන්න.",
     "හිස වෙඩි තැබීම විනෝදජනකයි. ඔබම එකක් ගන්න.",
     "ඔබ විශාල සුදු මෝරුන් සමඟ පිහිනීමට උත්සාහ කළ යුතුයි.",
     "ඔබ රතු පාටින් පින්තාරු කර ගොන් මැරතන් ධාවන තරඟයක යෙදිය යුතුය.",
     "නැවත ඉහළට නොගොස් ඔබේ ජීවිත කාලය පුරාම දිය යට රැඳී සිටිය හැකිය.",
     "ඔබ දින 1 ක් වැනි කාලයක් හුස්ම ගැනීම නවත්වන්නේ කෙසේද? එය විශිෂ්ට වනු ඇත.",
     "ඔබ දෙදෙනාම කූඩුවක සිටියදී කොටියෙකු කුපිත කිරීමට උත්සාහ කරන්න.",
     "ඔබ කැනනයකින් මීටර් 100 ක් තරම් ඉහළට වෙඩි තැබීමට උත්සාහ කර තිබේද?",
     "ඔබ ඔබේ කටේ ටීඑන්ටී අල්ලාගෙන එය දැල්වීමට උත්සාහ කළ යුතුයි.",
     "RDX සමඟ විනෝද වීමට උත්සාහ කරන්න.",
     "ෆොජින් විෂ සහිත බව මට දැනගන්නට ලැබුණි. නමුත් මම හිතන්නේ ඔබ එය විනෝදය සඳහා ආශ්වාස නොකරනු ඇත.",
     "පෘථිවියේ ඔක්සිජන් අමතක කර අභ්‍යවකාශයට පිවිසෙන්න.",
     "ඔබ සර්පයන් සහ ඉණිමඟ සෙල්ලම් කිරීමට උත්සාහ කළ යුතුයි. සැබෑ සර්පයන් සහ ඉණිමඟක් නොමැතිව.",
     "HT වයර් කිහිපයක් මත නිරුවතින් නටන්න.",
     "සැබෑ ගිනි කන්ද ඔබට හොඳම පිහිනුම් තටාකයයි.",
     "ඔබ ගිනි කන්දක උණුසුම් ස්නානය කිරීමට උත්සාහ කළ යුතුයි.",
     "මිනී පෙට්ටියක එක් දිනක් ගත කිරීමට උත්සාහ කරන්න. එය සදහටම ඔබට අයිති වනු ඇත.",
     "ඔබ ඉදිරියේ සෙමින් චලනය වන නියුට්‍රෝනයකින් යුරේනියම් පහර දෙන්න. එය වටිනා අත්දැකීමක් වනු ඇත.",
     "ඔබ හිරු මතට පය තැබූ පළමු පුද්ගලයා විය හැකිය. උත්සාහ කර බලන්න.",
 )

 SLAP_TEMPLATES = (
     "{අයිතමය} සමඟ {user1} {පහර} {පරිශීලක 2}.",
     "{අයිතමය with සමඟ මුහුණේ {{user1} {පහර} {පරිශීලක 2}.",
     "{අයිතමය with සමඟ මඳක් around {user1} {පහර} {user2}.",
     "{user1} {{user {}}} අයිතමයක්} විසි කරයි.",
     "{user1} {අයිතමයක්} අල්ලා {පරිශීලක 2 ගේ මුහුණට {විසි කරයි.",
     "{user1} {user2 general හි සාමාන්‍ය දිශාවට {අයිතමයක් දියත් කරයි.",
     "{user1} {අයිතමය with සමඟ {user2} මෝඩකමට පහර දීම ආරම්භ කරයි.",
     "{user1} pins {user2} පහළට ගොස් {අයිතමය with සමඟ නැවත නැවත {පහර}.",
     "{user1} {අයිතමයක්} අල්ලාගෙන {{user2 its සමඟ එය පහර දෙයි.",
     "{user1} {user2 a පුටුවකට බැඳ {{අයිතමයක්} ඔවුන් වෙතට විසි කරයි.",
     "{user1 la ලාවා තුළ පිහිනීමට ඉගෙන ගැනීමට {user2 help සඳහා සුහද තල්ලුවක් ලබා දුන්නේය."
 )

 ITEMS = (
     "වාත්තු යකඩ සායක්",
     "විශාල තුරුම්පුව",
     "බේස්බෝල් පිත්ත",
     "ක්රිකට් පිත්ත",
     "ලී වේවැල්",
     "නිය",
     "මුද්‍රණ යන්ත්‍රය",
     "සවල",
     "CRT මොනිටරය",
     "භෞතික විද්‍යා පෙළ පොත",
     "ටෝස්ටර්",
     "රිචඩ් ස්ටෝල්මන්ගේ ආලේඛ්‍ය චිත්‍රය",
     "රූපවාහිනිය",
     "ටොන් පහක ට්‍රක්",
     "ඩක් ටේප් රෝල්",
     "පොත",
     "ලැප්ටොප්",
     "පැරණි රූපවාහිනිය",
     "පාෂාණ මල්ල",
     "දේදුන්න තුරුම්පුව",
     "රබර් චිකන්",
     "ස්පයික් බැට්",
     "ගිනි නිවනය",
     "බර පාෂාණය",
     "කුණු කැබැල්ල",
     "මී මැසි",
     "කුණු වූ මස් කැබැල්ලක්",
     "වලහා",
     "ගඩොල් ටොන්",
 )

 THROW = (
     "විසි",
     "පියාඹන",
     "චක්ස්",
     "හර්ස්",
 )

 HIT = (
     "පහර",
     "whacks",
     "කම්මුල්",
     "ස්මාක්ස්",
     "බාෂ්",
 )

 MARKDOWN_HELP = "" "
 මාර්ක්ඩවුන් යනු විදුලි පණිවුඩ මඟින් සහාය දක්වන ඉතා ප්‍රබල හැඩතල ගැන්වීමේ මෙවලමකි.  that that සමහර වැඩි දියුණු කිරීම් ඇත, එය තහවුරු කර ගැනීම සඳහා \
 සුරකින ලද පණිවිඩ නිවැරදිව විග්‍රහ කර ඇති අතර බොත්තම් සෑදීමට ඔබට ඉඩ සලසයි.

 - <code> _italic_ </code>: '_' සමඟ පෙළ එතීමෙන් ඇල අකුරු නිපදවනු ඇත
 - <code> * bold * </code>: '*' සමඟ පෙළ එතීමෙන් තද අකුරු ලැබෙනු ඇත
 - <code> `කේතය` </code>: '' 'සමඟ පෙළ එතීමෙන් ඒකවර්ණ පෙළ නිපදවනු ඇත, එය' කේතය 'ලෙසද හැඳින්වේ.
 - <code> [යම්කිසි පෙළක්)
 එය තට්ටු කිරීමෙන් <code> someURL </code> හි පිටුව විවෘත වේ.
 EG: <code> [test] (example.com) </code>

 - <code> [buttontext] (buttonurl: someURL) </code>: මෙය පරිශීලකයින්ට විදුලි පණිවුඩ ලබා ගැනීමට ඉඩ දීම සඳහා විශේෂ වැඩි දියුණු කිරීමකි \
 ඒවායේ සලකුණු කිරීමේ බොත්තම්.  <code> buttontext </code> යනු බොත්තම මත දිස්වන දෙය වන අතර <code> someurl </code> \
 විවෘත කරන ලද url එක වනු ඇත.
 EG: <code> [මෙය බොත්තමක්] (buttonurl: example.com) </code>

 ඔබට එකම පේළියේ බොත්තම් කිහිපයක් අවශ්‍ය නම්, භාවිතා කරන්න: එකම, වැනි:
 <code> [එකක්] (buttonurl: //example.com)
 [two] (buttonurl: //google.com: same) </code>
 මෙය එක් පේළියකට එක් බොත්තමක් වෙනුවට තනි පේළියක බොත්තම් දෙකක් නිර්මාණය කරයි.
 "" "

 EnglishStrings = {
     "send-start": "" "හායි {}, මගේ නම {}! මා භාවිතා කරන්නේ කෙසේද යන්න පිළිබඳව ඔබට කිසියම් ප්‍රශ්නයක් ඇත්නම්, කියවන්න / උදව් කරන්න - ඉන්පසු ana YanaBotGroup වෙත යන්න.

 මම [මෙම පුද්ගලයා] විසින් නඩත්තු කරනු ලබන කණ්ඩායම් කළමනාකරු බොට් (tg: // user? Id = {654839744}).  මම [මාරි] (https://github.com/PaulSonOfLars/tgbot) දෙබලක.
 මම පයිතන් 3 හි ඉදිකර ඇත, using භාවිතා කරමින්
 python-telegram-bot පුස්තකාලය, සහ මම සම්පූර්ණයෙන්ම විවෘත මූලාශ්‍රයක් - මට ටික් කිරීමට හේතුව කුමක්දැයි ඔබට සොයාගත හැකිය \
 [මෙහි] (https://github.com/peaktogoo/HarukaAya))!

 ගිතුබ් වෙතින් ඉල්ලීම් ඉදිරිපත් කිරීමට නිදහස් වන්න, නැතහොත් මගේ ආධාරක කණ්ඩායම වන chEchelonTeam, ඕනෑම දෝෂ, ප්‍රශ්න සමඟ සම්බන්ධ කර ගන්න.
 හෝ ඔබට තිබිය හැකි විශේෂාංග ඉල්ලීම් :)

 ඔබ මා භාවිතා කිරීමෙන් සතුටක් ලබනවා නම් සහ / හෝ වනයේ ජීවත් වීමට මට උදව් කිරීමට කැමති නම්, මගේ වීපීඑස් අරමුදල් / වැඩිදියුණු කිරීමට උදව් කිරීමට පහර දෙන්න / පරිත්‍යාග කරන්න!
 "" ",

     "send-help": "" "හේයි! මගේ නම * {} *.
 මම විනෝදජනක අමතර කිහිපයක් සහිත මොඩියුලර් කණ්ඩායම් කළමනාකරණ බොට්!  මට ඔබට උදව් කළ හැකි කරුණු කිහිපයක් පිළිබඳ අදහසක් සඳහා පහත සඳහන් කරුණු දෙස බලන්න.

 ලබා ගත හැකි ප්‍රධාන විධාන:
  - / start: බොට් ජීවතුන් අතර සිටීද යන්න පරීක්ෂා කිරීමට සිසිල් විධානය
  - / help: අගමැති ඔබ මෙම පණිවිඩයයි.
  - / help <මොඩියුලයේ නම>: එම මොඩියුලය පිළිබඳ අගමැතිගේ තොරතුරු.
  - / පරිත්යාග කරන්න: පරිත්යාග කරන්නේ කෙසේද යන්න පිළිබඳ තොරතුරු!
  - / lang: බොට් භාෂාව වෙනස් කරන්න
  - /සැකසුම්:
    - PM හි: සහාය දක්වන සියලුම මොඩියුල සඳහා ඔබගේ සැකසුම් ඔබට එවනු ඇත.
    - කණ්ඩායමක: චැට් හි සියලු සැකසුම් සමඟ ඔබව ප.ව.
    {}
    "" ",

     "send-group-settings": "" "ආයුබෝවන්! * {} * සඳහා සැකසුම් කිහිපයක් තිබේ - ඉදිරියට ගොස් කුමක් තෝරා ගන්න
 ඔබ කැමති. "" ",

 # වැරදි
 "RUNS-K": RUN_STRINGS,
 "SLAP_TEMPLATES-K": SLAP_TEMPLATES,
 "ITEMS-K": ITEMS,
 "HIT-K": HIT,
 "THROW-K": විසි කරන්න,
 "ITEMP-K": ITEMS,
 "ITEMR-K": ITEMS,
 "MARKDOWN_HELP-K": MARKDOWN_HELP,
 "INSULTS-K": INSULTS_STRINGS,

 #GDPR
 "send-gdpr": "" "ඔබගේ පුද්ගලික දත්ත මකා දමා ඇත. \ n \ n මෙය තහනම් නොවන බව සලකන්න \
 ඔබ ඕනෑම කතාබස් වලින්, එය විදුලි පණිවුඩ දත්ත මිස යනාබොට් දත්ත නොවේ.
 \ ලෙස ගංවතුර, අනතුරු ඇඟවීම් සහ ග්බාන්ස් ද ආරක්ෂා වේ.
 [මෙය] (https://ico.org.uk/for-organisations/guide-to-the-general-data-protection-regulation-gdpr/individual-rights/right-to-erasure/), "
 මකාදැමීමේ අයිතිය අදාළ නොවන බව පැහැදිලිව සඳහන් කරයි \
 interest "මහජන යහපත උදෙසා ඉටු කරන ලද කාර්යයක් ඉටු කිරීම සඳහා \"
 ඉහත දත්ත කැබලි සඳහා නඩුව. "" "

 }
